[Interface]

ProblemSize=Объём задачи:
MemoryToUse=Память (МиБ):
AllMem=Вся
NumberOfTimes=Выполнять:
Times=раз
Minutes=минут
Start=Тест
Stop=Стоп


[Hints]

ProblemSize=Влияет на сложность и длительность вычислений (большие значения для большей нагрузки)
ComboboxHint=Выберите значение из списка или введите вручную
MemoryToUse=Соответствует выбранному объёму задачи
AllMem=Если нажато — всегда использовать всю свободную память
NumberOfTimes=Тестирование будет остановлено или после указанного числа раз, или по прошествии указанного интервала времени
Start=Запуск процесса тестирования (Enter)
Stop=Немедленно остановить тестирование (Esc)
StatusPanel1=Двойной клик — показать доступную память
StatusPanel2=Клик — смена режима отображения времени, двойной клик - вкл./выкл. показ времени
StatusPanel3=Клик правой кнопкой — меню настроек


[MainMenu]

File=Файл
SaveScreenshot=Сохранить скриншот
SaveTextLog=Сохранить отчёт
Exit=Выход
Settings=Настройки
About=?
Graphs=Графики


[WindowCaptions]

Idle=Просто Linpack
Test=Тестирование
Error=Ошибка
Overheat=Перегрев ЦП
Done=Завершено
Stop=Остановлено


[Info]

1=LinX — это простой интерфейс к бенчмарку Intel® Linpack.
2=Проверяет стабильность и обнаруживает ошибки оборудования.
3=Рекомендуется использовать совместно с ПО для мониторинга температуры процессора во избежание возможного перегрева.
4=Желательно также следить за температурой схемы питания процессора для процессоров с высоким TDP.


[Facts]

1=Многие элементы интерфейса имеют полезные подсказки.
2=Двойной клик по заголовку зафиксирует окно поверх всех окон.
3=Правый клик по прогрессбару вызовет меню с настройками.
4=Клик по нему же во время теста меняет отображение времени.
5=Графики доступны только при импорте из Everest или Speedfan.
6=Размеры графиков можно менять, сохранение — двойной клик.
7=Список доступных ключей командной строки: LinX.exe /help.


[CommandLine]

1=Все параметры командной строки начинаются с „-“ или „/“,
2=например, /help или -help. X — любая десятичная цифра.
3=Поддерживаемые ключи командной строки:
4=?, h, help — показать это сообщение;
5=psXXXXX — установить желаемое значение Объёма задачи;
6=mXXXX — установить желаемое значение Объёма памяти;
7=nXXX — установить желаемое значение числа тестов;
8=tXXX — установить желаемое значение времени тестов (в минутах);
9=mm, maxmemory — использовать всю доступную память;
10=64 — использовать 64-битный Linpack;
11=32 — использовать 32-битный Linpack;
12=m, minimized — запускать свёрнутым;
13=a, autostart — сразу начинать тестирование.
14=Возможна любая комбинация ключей, однако
15=одни могут доминировать над другими.
Caption=Ключи командной строки LinX


[GraphCaptions]

Temp=Температура ЦП
Fan=Скорость вентилятора ЦП
VCore=Напряжение ядра ЦП
12V=Напряжение +12 В


[Messages]

NoEXE=Не найдены необходимые файлы Linpack. Программа будет закрыта.
CantStart=Невозможно запустить Linpack!
NoMem=Недостаточно физической памяти! Значения будут исправлены.
Lin32Lim=Невозможно выделить более ~2ГБ памяти из-за ограничения Linpack x32. Значения будут исправлены.
ExitConfirm=Идёт тестирование. Прервать его и выйти?


[StatusPanel]

Idle=Свободно физической памяти:
Stop=Остановлено по требованию после
Done=Завершено без ошибок за
DoneWError=Завершено с ошибками за
Error=Остановлено из-за ошибки после
Overheat=Остановлено из-за перегрева после
LinStopped=Linpack был внезапно завершён (недостаточно памяти?)
Elapsed=Прошло
Remaining=Осталось
FinishTime=Примерное время завершения:
Wait=Подождите…


[OutputTable]

Number=№
Size=Размер
LDA=Измер.
Align=Выр.
Time=Время
GFlops=ГФлопс
Residual=Невязка
Residual(norm)=Невязка (норм.)


[Taskbar]

Stop=Остановлено
Done=Завершено
Error=Ошибка!
Overheat=Перегрев!


[Statusbar]

CPU=ЦП:
Peak=пик
Separator=|
Log=Лог ›
Table=‹ Таблица


[MeasUnits]

MiB=МиБ
32=32-бит
64=64-бит
GFlops=ГФлопс
h=ч
m=м
s=с
Volt=В
MHz=МГц
Grad=°
Celsius=°C
RPM=Об./мин


[TrayMenu]

Minimize=Свернуть
Restore=Развернуть
Exit=Выход


[SettingsMenu]

Thread=поток
Threads=потока
ThreadsAlt=потоков
ThreadsCaption=Потоки
Custom=Другое

AllSettings=Все настройки…
StopOnError=Стоп при ошибке
AutoSaveLog=Автосохранение отчёта
Sounds=Звуки
TrayIcon=Значок в трее


[SettingsWindow]

Caption=Настройки

Mode=Режим:
ModeHint=64-битный Linpack создаёт бОльшую нагрузку. Используйте его на 64-битной ОС
NumberOfThreads=Число потоков:
NumberOfThreadsHint=Здесь можно изменить число создаваемых Linpack потоков. Это также число используемых ядер ЦП
PriorityClass=Приоритет:
PriorityClassHint=Понижение приоритета Linpack увеличит «отзывчивость» системы во время тестирования. Повышение приоритета выше Нормального не рекомендуется
Idle=Самый низкий
BelowNormal=Низкий
Normal=Обычный
AboveNormal=Высокий
High=Самый высокий
Realtime=Реального времени
DataAlignment=Выравнивание (КиБ):
DataAlignmentHint=Данные во время работы будут выравниваться по этому значению. 4 - оптимально, 0 - без выравнивания
Lin32MaxProblemSize=Макс. объём задачи Lin32:
Lin32MaxProblemSizeHint=Максимально допистимый объём задачи для 32-битного Linpack (найдено опытным путем). Изменяйте только в случае проблем с запуском
MemoryToLeave=Память для ОС (МиБ):
MemoryToLeaveHint=Объём физической памяти, который будет оставлен системе при выборе для тестирования всей памяти. Не устанавливайте слишком низкие значения

ExtendGlass=Эффект стекла (только с Aero)
ExtendGlassHint=Если выбрано — Aero-стекло будет расширено в клиентскую область окон приложения
ShowHints=Всплывающие подсказки
StopOnError=Стоп при ошибке
StopOnErrorHint=Если выбрано — тестирование будет прервано при ошибке (рекомендуется)
AutoSaveLog=Автосохранение отчёта
AutoSaveLogHint=Если выбрано — отчёт будет сохраняться после каждого пройденного теста
Sounds=Звуки
SoundsHint=Если выбрано — LinX будет воспроизводить звуковой сигнал при ошибке/успешном завершении
TrayIcon=Значок в трее
TrayIconHint=Если выбрано — отображать значок в системном трее и сворачивать в трей
Filenames=Дата/время в именах файлов
FilenamesHint=Если выбрано — ко всем файлам скриншотов и отчётов будет добавляться текущие либо начальные дата и время соответственно
ShowHints=Всплывающие подсказки
ShowHintsHint=Если выбрано — показывать всплывающие подсказки, такие как вот эта

ExtAppsBox=Импорт из внешних приложений
MaxTemp=Предельная темп. (°C):
MaxTempHint=Если выбрано — тестирование будет остановлено по достижении указанной температуры
None=Выкл.
Graphs=Графики:
GraphsHint=Выберите, какие графики будут строиться во время тестирования
CPUTemp=Темп. ЦП
CPUFan=Вент. ЦП
CPUVcore=Vcore ЦП

ButtonOK=OK
ButtonCancel=Отмена

[AboutWindow]

Info=Информация
About=О программе